{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Performing the basic Cypher queries on the sample data movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Establishing the connection "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = 'bolt://localhost:7687'\n",
    "moviesdb = GraphDatabase.driver(uri=uri, auth=('neo4j', '123'))\n",
    "\n",
    "session = moviesdb.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Creating the sample movies database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "q1 = \"\"\"// load movies\n",
    "// This is an initialization script for the movie graph.\n",
    "// Run it only once. ;)\n",
    "// Have you run it twice? Use `MATCH (n) WHERE (n:Person OR n:Movie) DETACH DELETE n` to start over.\n",
    "CREATE (TheMatrix:Movie {title:'The Matrix', released:1999, tagline:'Welcome to the Real World'})\n",
    "CREATE (Keanu:Person {name:'Keanu Reeves', born:1964})\n",
    "CREATE (Carrie:Person {name:'Carrie-Anne Moss', born:1967})\n",
    "CREATE (Laurence:Person {name:'Laurence Fishburne', born:1961})\n",
    "CREATE (Hugo:Person {name:'Hugo Weaving', born:1960})\n",
    "CREATE (AndyW:Person {name:'Andy Wachowski', born:1967})\n",
    "CREATE (LanaW:Person {name:'Lana Wachowski', born:1965})\n",
    "CREATE (JoelS:Person {name:'Joel Silver', born:1952})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Neo']}]->(TheMatrix),\n",
    "  (Carrie)-[:ACTED_IN {roles:['Trinity']}]->(TheMatrix),\n",
    "  (Laurence)-[:ACTED_IN {roles:['Morpheus']}]->(TheMatrix),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Agent Smith']}]->(TheMatrix),\n",
    "  (AndyW)-[:DIRECTED]->(TheMatrix),\n",
    "  (LanaW)-[:DIRECTED]->(TheMatrix),\n",
    "  (JoelS)-[:PRODUCED]->(TheMatrix)\n",
    "CREATE (Emil:Person {name:\"Emil Eifrem\", born:1978})\n",
    "CREATE (Emil)-[:ACTED_IN {roles:[\"Emil\"]}]->(TheMatrix)\n",
    "CREATE (TheMatrixReloaded:Movie {title:'The Matrix Reloaded', released:2003, tagline:'Free your mind'})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Neo']}]->(TheMatrixReloaded),\n",
    "  (Carrie)-[:ACTED_IN {roles:['Trinity']}]->(TheMatrixReloaded),\n",
    "  (Laurence)-[:ACTED_IN {roles:['Morpheus']}]->(TheMatrixReloaded),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Agent Smith']}]->(TheMatrixReloaded),\n",
    "  (AndyW)-[:DIRECTED]->(TheMatrixReloaded),\n",
    "  (LanaW)-[:DIRECTED]->(TheMatrixReloaded),\n",
    "  (JoelS)-[:PRODUCED]->(TheMatrixReloaded)\n",
    "CREATE (TheMatrixRevolutions:Movie {title:'The Matrix Revolutions', released:2003, tagline:'Everything that has a beginning has an end'})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Neo']}]->(TheMatrixRevolutions),\n",
    "  (Carrie)-[:ACTED_IN {roles:['Trinity']}]->(TheMatrixRevolutions),\n",
    "  (Laurence)-[:ACTED_IN {roles:['Morpheus']}]->(TheMatrixRevolutions),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Agent Smith']}]->(TheMatrixRevolutions),\n",
    "  (AndyW)-[:DIRECTED]->(TheMatrixRevolutions),\n",
    "  (LanaW)-[:DIRECTED]->(TheMatrixRevolutions),\n",
    "  (JoelS)-[:PRODUCED]->(TheMatrixRevolutions)\n",
    "CREATE (TheDevilsAdvocate:Movie {title:\"The Devil's Advocate\", released:1997, tagline:'Evil has its winning ways'})\n",
    "CREATE (Charlize:Person {name:'Charlize Theron', born:1975})\n",
    "CREATE (Al:Person {name:'Al Pacino', born:1940})\n",
    "CREATE (Taylor:Person {name:'Taylor Hackford', born:1944})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Kevin Lomax']}]->(TheDevilsAdvocate),\n",
    "  (Charlize)-[:ACTED_IN {roles:['Mary Ann Lomax']}]->(TheDevilsAdvocate),\n",
    "  (Al)-[:ACTED_IN {roles:['John Milton']}]->(TheDevilsAdvocate),\n",
    "  (Taylor)-[:DIRECTED]->(TheDevilsAdvocate)\n",
    "CREATE (AFewGoodMen:Movie {title:\"A Few Good Men\", released:1992, tagline:\"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\"})\n",
    "CREATE (TomC:Person {name:'Tom Cruise', born:1962})\n",
    "CREATE (JackN:Person {name:'Jack Nicholson', born:1937})\n",
    "CREATE (DemiM:Person {name:'Demi Moore', born:1962})\n",
    "CREATE (KevinB:Person {name:'Kevin Bacon', born:1958})\n",
    "CREATE (KieferS:Person {name:'Kiefer Sutherland', born:1966})\n",
    "CREATE (NoahW:Person {name:'Noah Wyle', born:1971})\n",
    "CREATE (CubaG:Person {name:'Cuba Gooding Jr.', born:1968})\n",
    "CREATE (KevinP:Person {name:'Kevin Pollak', born:1957})\n",
    "CREATE (JTW:Person {name:'J.T. Walsh', born:1943})\n",
    "CREATE (JamesM:Person {name:'James Marshall', born:1967})\n",
    "CREATE (ChristopherG:Person {name:'Christopher Guest', born:1948})\n",
    "CREATE (RobR:Person {name:'Rob Reiner', born:1947})\n",
    "CREATE (AaronS:Person {name:'Aaron Sorkin', born:1961})\n",
    "CREATE\n",
    "  (TomC)-[:ACTED_IN {roles:['Lt. Daniel Kaffee']}]->(AFewGoodMen),\n",
    "  (JackN)-[:ACTED_IN {roles:['Col. Nathan R. Jessup']}]->(AFewGoodMen),\n",
    "  (DemiM)-[:ACTED_IN {roles:['Lt. Cdr. JoAnne Galloway']}]->(AFewGoodMen),\n",
    "  (KevinB)-[:ACTED_IN {roles:['Capt. Jack Ross']}]->(AFewGoodMen),\n",
    "  (KieferS)-[:ACTED_IN {roles:['Lt. Jonathan Kendrick']}]->(AFewGoodMen),\n",
    "  (NoahW)-[:ACTED_IN {roles:['Cpl. Jeffrey Barnes']}]->(AFewGoodMen),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Cpl. Carl Hammaker']}]->(AFewGoodMen),\n",
    "  (KevinP)-[:ACTED_IN {roles:['Lt. Sam Weinberg']}]->(AFewGoodMen),\n",
    "  (JTW)-[:ACTED_IN {roles:['Lt. Col. Matthew Andrew Markinson']}]->(AFewGoodMen),\n",
    "  (JamesM)-[:ACTED_IN {roles:['Pfc. Louden Downey']}]->(AFewGoodMen),\n",
    "  (ChristopherG)-[:ACTED_IN {roles:['Dr. Stone']}]->(AFewGoodMen),\n",
    "  (AaronS)-[:ACTED_IN {roles:['Man in Bar']}]->(AFewGoodMen),\n",
    "  (RobR)-[:DIRECTED]->(AFewGoodMen),\n",
    "  (AaronS)-[:WROTE]->(AFewGoodMen)\n",
    "CREATE (TopGun:Movie {title:\"Top Gun\", released:1986, tagline:'I feel the need, the need for speed.'})\n",
    "CREATE (KellyM:Person {name:'Kelly McGillis', born:1957})\n",
    "CREATE (ValK:Person {name:'Val Kilmer', born:1959})\n",
    "CREATE (AnthonyE:Person {name:'Anthony Edwards', born:1962})\n",
    "CREATE (TomS:Person {name:'Tom Skerritt', born:1933})\n",
    "CREATE (MegR:Person {name:'Meg Ryan', born:1961})\n",
    "CREATE (TonyS:Person {name:'Tony Scott', born:1944})\n",
    "CREATE (JimC:Person {name:'Jim Cash', born:1941})\n",
    "CREATE\n",
    "  (TomC)-[:ACTED_IN {roles:['Maverick']}]->(TopGun),\n",
    "  (KellyM)-[:ACTED_IN {roles:['Charlie']}]->(TopGun),\n",
    "  (ValK)-[:ACTED_IN {roles:['Iceman']}]->(TopGun),\n",
    "  (AnthonyE)-[:ACTED_IN {roles:['Goose']}]->(TopGun),\n",
    "  (TomS)-[:ACTED_IN {roles:['Viper']}]->(TopGun),\n",
    "  (MegR)-[:ACTED_IN {roles:['Carole']}]->(TopGun),\n",
    "  (TonyS)-[:DIRECTED]->(TopGun),\n",
    "  (JimC)-[:WROTE]->(TopGun)\n",
    "CREATE (JerryMaguire:Movie {title:'Jerry Maguire', released:2000, tagline:'The rest of his life begins now.'})\n",
    "CREATE (ReneeZ:Person {name:'Renee Zellweger', born:1969})\n",
    "CREATE (KellyP:Person {name:'Kelly Preston', born:1962})\n",
    "CREATE (JerryO:Person {name:\"Jerry O'Connell\", born:1974})\n",
    "CREATE (JayM:Person {name:'Jay Mohr', born:1970})\n",
    "CREATE (BonnieH:Person {name:'Bonnie Hunt', born:1961})\n",
    "CREATE (ReginaK:Person {name:'Regina King', born:1971})\n",
    "CREATE (JonathanL:Person {name:'Jonathan Lipnicki', born:1996})\n",
    "CREATE (CameronC:Person {name:'Cameron Crowe', born:1957})\n",
    "CREATE\n",
    "  (TomC)-[:ACTED_IN {roles:['Jerry Maguire']}]->(JerryMaguire),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Rod Tidwell']}]->(JerryMaguire),\n",
    "  (ReneeZ)-[:ACTED_IN {roles:['Dorothy Boyd']}]->(JerryMaguire),\n",
    "  (KellyP)-[:ACTED_IN {roles:['Avery Bishop']}]->(JerryMaguire),\n",
    "  (JerryO)-[:ACTED_IN {roles:['Frank Cushman']}]->(JerryMaguire),\n",
    "  (JayM)-[:ACTED_IN {roles:['Bob Sugar']}]->(JerryMaguire),\n",
    "  (BonnieH)-[:ACTED_IN {roles:['Laurel Boyd']}]->(JerryMaguire),\n",
    "  (ReginaK)-[:ACTED_IN {roles:['Marcee Tidwell']}]->(JerryMaguire),\n",
    "  (JonathanL)-[:ACTED_IN {roles:['Ray Boyd']}]->(JerryMaguire),\n",
    "  (CameronC)-[:DIRECTED]->(JerryMaguire),\n",
    "  (CameronC)-[:PRODUCED]->(JerryMaguire),\n",
    "  (CameronC)-[:WROTE]->(JerryMaguire)\n",
    "CREATE (StandByMe:Movie {title:\"Stand By Me\", released:1986, tagline:\"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\"})\n",
    "CREATE (RiverP:Person {name:'River Phoenix', born:1970})\n",
    "CREATE (CoreyF:Person {name:'Corey Feldman', born:1971})\n",
    "CREATE (WilW:Person {name:'Wil Wheaton', born:1972})\n",
    "CREATE (JohnC:Person {name:'John Cusack', born:1966})\n",
    "CREATE (MarshallB:Person {name:'Marshall Bell', born:1942})\n",
    "CREATE\n",
    "  (WilW)-[:ACTED_IN {roles:['Gordie Lachance']}]->(StandByMe),\n",
    "  (RiverP)-[:ACTED_IN {roles:['Chris Chambers']}]->(StandByMe),\n",
    "  (JerryO)-[:ACTED_IN {roles:['Vern Tessio']}]->(StandByMe),\n",
    "  (CoreyF)-[:ACTED_IN {roles:['Teddy Duchamp']}]->(StandByMe),\n",
    "  (JohnC)-[:ACTED_IN {roles:['Denny Lachance']}]->(StandByMe),\n",
    "  (KieferS)-[:ACTED_IN {roles:['Ace Merrill']}]->(StandByMe),\n",
    "  (MarshallB)-[:ACTED_IN {roles:['Mr. Lachance']}]->(StandByMe),\n",
    "  (RobR)-[:DIRECTED]->(StandByMe)\n",
    "CREATE (AsGoodAsItGets:Movie {title:'As Good as It Gets', released:1997, tagline:'A comedy from the heart that goes for the throat.'})\n",
    "CREATE (HelenH:Person {name:'Helen Hunt', born:1963})\n",
    "CREATE (GregK:Person {name:'Greg Kinnear', born:1963})\n",
    "CREATE (JamesB:Person {name:'James L. Brooks', born:1940})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Melvin Udall']}]->(AsGoodAsItGets),\n",
    "  (HelenH)-[:ACTED_IN {roles:['Carol Connelly']}]->(AsGoodAsItGets),\n",
    "  (GregK)-[:ACTED_IN {roles:['Simon Bishop']}]->(AsGoodAsItGets),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Frank Sachs']}]->(AsGoodAsItGets),\n",
    "  (JamesB)-[:DIRECTED]->(AsGoodAsItGets)\n",
    "CREATE (WhatDreamsMayCome:Movie {title:'What Dreams May Come', released:1998, tagline:'After life there is more. The end is just the beginning.'})\n",
    "CREATE (AnnabellaS:Person {name:'Annabella Sciorra', born:1960})\n",
    "CREATE (MaxS:Person {name:'Max von Sydow', born:1929})\n",
    "CREATE (WernerH:Person {name:'Werner Herzog', born:1942})\n",
    "CREATE (Robin:Person {name:'Robin Williams', born:1951})\n",
    "CREATE (VincentW:Person {name:'Vincent Ward', born:1956})\n",
    "CREATE\n",
    "  (Robin)-[:ACTED_IN {roles:['Chris Nielsen']}]->(WhatDreamsMayCome),\n",
    "  (CubaG)-[:ACTED_IN {roles:['Albert Lewis']}]->(WhatDreamsMayCome),\n",
    "  (AnnabellaS)-[:ACTED_IN {roles:['Annie Collins-Nielsen']}]->(WhatDreamsMayCome),\n",
    "  (MaxS)-[:ACTED_IN {roles:['The Tracker']}]->(WhatDreamsMayCome),\n",
    "  (WernerH)-[:ACTED_IN {roles:['The Face']}]->(WhatDreamsMayCome),\n",
    "  (VincentW)-[:DIRECTED]->(WhatDreamsMayCome)\n",
    "CREATE (SnowFallingonCedars:Movie {title:'Snow Falling on Cedars', released:1999, tagline:'First loves last. Forever.'})\n",
    "CREATE (EthanH:Person {name:'Ethan Hawke', born:1970})\n",
    "CREATE (RickY:Person {name:'Rick Yune', born:1971})\n",
    "CREATE (JamesC:Person {name:'James Cromwell', born:1940})\n",
    "CREATE (ScottH:Person {name:'Scott Hicks', born:1953})\n",
    "CREATE\n",
    "  (EthanH)-[:ACTED_IN {roles:['Ishmael Chambers']}]->(SnowFallingonCedars),\n",
    "  (RickY)-[:ACTED_IN {roles:['Kazuo Miyamoto']}]->(SnowFallingonCedars),\n",
    "  (MaxS)-[:ACTED_IN {roles:['Nels Gudmundsson']}]->(SnowFallingonCedars),\n",
    "  (JamesC)-[:ACTED_IN {roles:['Judge Fielding']}]->(SnowFallingonCedars),\n",
    "  (ScottH)-[:DIRECTED]->(SnowFallingonCedars)\n",
    "CREATE (YouveGotMail:Movie {title:\"You've Got Mail\", released:1998, tagline:'At odds in life... in love on-line.'})\n",
    "CREATE (ParkerP:Person {name:'Parker Posey', born:1968})\n",
    "CREATE (DaveC:Person {name:'Dave Chappelle', born:1973})\n",
    "CREATE (SteveZ:Person {name:'Steve Zahn', born:1967})\n",
    "CREATE (TomH:Person {name:'Tom Hanks', born:1956})\n",
    "CREATE (NoraE:Person {name:'Nora Ephron', born:1941})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Joe Fox']}]->(YouveGotMail),\n",
    "  (MegR)-[:ACTED_IN {roles:['Kathleen Kelly']}]->(YouveGotMail),\n",
    "  (GregK)-[:ACTED_IN {roles:['Frank Navasky']}]->(YouveGotMail),\n",
    "  (ParkerP)-[:ACTED_IN {roles:['Patricia Eden']}]->(YouveGotMail),\n",
    "  (DaveC)-[:ACTED_IN {roles:['Kevin Jackson']}]->(YouveGotMail),\n",
    "  (SteveZ)-[:ACTED_IN {roles:['George Pappas']}]->(YouveGotMail),\n",
    "  (NoraE)-[:DIRECTED]->(YouveGotMail)\n",
    "CREATE (SleeplessInSeattle:Movie {title:'Sleepless in Seattle', released:1993, tagline:'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?'})\n",
    "CREATE (RitaW:Person {name:'Rita Wilson', born:1956})\n",
    "CREATE (BillPull:Person {name:'Bill Pullman', born:1953})\n",
    "CREATE (VictorG:Person {name:'Victor Garber', born:1949})\n",
    "CREATE (RosieO:Person {name:\"Rosie O'Donnell\", born:1962})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Sam Baldwin']}]->(SleeplessInSeattle),\n",
    "  (MegR)-[:ACTED_IN {roles:['Annie Reed']}]->(SleeplessInSeattle),\n",
    "  (RitaW)-[:ACTED_IN {roles:['Suzy']}]->(SleeplessInSeattle),\n",
    "  (BillPull)-[:ACTED_IN {roles:['Walter']}]->(SleeplessInSeattle),\n",
    "  (VictorG)-[:ACTED_IN {roles:['Greg']}]->(SleeplessInSeattle),\n",
    "  (RosieO)-[:ACTED_IN {roles:['Becky']}]->(SleeplessInSeattle),\n",
    "  (NoraE)-[:DIRECTED]->(SleeplessInSeattle)\n",
    "CREATE (JoeVersustheVolcano:Movie {title:'Joe Versus the Volcano', released:1990, tagline:'A story of love, lava and burning desire.'})\n",
    "CREATE (JohnS:Person {name:'John Patrick Stanley', born:1950})\n",
    "CREATE (Nathan:Person {name:'Nathan Lane', born:1956})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Joe Banks']}]->(JoeVersustheVolcano),\n",
    "  (MegR)-[:ACTED_IN {roles:['DeDe', 'Angelica Graynamore', 'Patricia Graynamore']}]->(JoeVersustheVolcano),\n",
    "  (Nathan)-[:ACTED_IN {roles:['Baw']}]->(JoeVersustheVolcano),\n",
    "  (JohnS)-[:DIRECTED]->(JoeVersustheVolcano)\n",
    "CREATE (WhenHarryMetSally:Movie {title:'When Harry Met Sally', released:1998, tagline:'At odds in life... in love on-line.'})\n",
    "CREATE (BillyC:Person {name:'Billy Crystal', born:1948})\n",
    "CREATE (CarrieF:Person {name:'Carrie Fisher', born:1956})\n",
    "CREATE (BrunoK:Person {name:'Bruno Kirby', born:1949})\n",
    "CREATE\n",
    "  (BillyC)-[:ACTED_IN {roles:['Harry Burns']}]->(WhenHarryMetSally),\n",
    "  (MegR)-[:ACTED_IN {roles:['Sally Albright']}]->(WhenHarryMetSally),\n",
    "  (CarrieF)-[:ACTED_IN {roles:['Marie']}]->(WhenHarryMetSally),\n",
    "  (BrunoK)-[:ACTED_IN {roles:['Jess']}]->(WhenHarryMetSally),\n",
    "  (RobR)-[:DIRECTED]->(WhenHarryMetSally),\n",
    "  (RobR)-[:PRODUCED]->(WhenHarryMetSally),\n",
    "  (NoraE)-[:PRODUCED]->(WhenHarryMetSally),\n",
    "  (NoraE)-[:WROTE]->(WhenHarryMetSally)\n",
    "CREATE (ThatThingYouDo:Movie {title:'That Thing You Do', released:1996, tagline:'In every life there comes a time when that thing you dream becomes that thing you do'})\n",
    "CREATE (LivT:Person {name:'Liv Tyler', born:1977})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Mr. White']}]->(ThatThingYouDo),\n",
    "  (LivT)-[:ACTED_IN {roles:['Faye Dolan']}]->(ThatThingYouDo),\n",
    "  (Charlize)-[:ACTED_IN {roles:['Tina']}]->(ThatThingYouDo),\n",
    "  (TomH)-[:DIRECTED]->(ThatThingYouDo)\n",
    "CREATE (TheReplacements:Movie {title:'The Replacements', released:2000, tagline:'Pain heals, Chicks dig scars... Glory lasts forever'})\n",
    "CREATE (Brooke:Person {name:'Brooke Langton', born:1970})\n",
    "CREATE (Gene:Person {name:'Gene Hackman', born:1930})\n",
    "CREATE (Orlando:Person {name:'Orlando Jones', born:1968})\n",
    "CREATE (Howard:Person {name:'Howard Deutch', born:1950})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Shane Falco']}]->(TheReplacements),\n",
    "  (Brooke)-[:ACTED_IN {roles:['Annabelle Farrell']}]->(TheReplacements),\n",
    "  (Gene)-[:ACTED_IN {roles:['Jimmy McGinty']}]->(TheReplacements),\n",
    "  (Orlando)-[:ACTED_IN {roles:['Clifford Franklin']}]->(TheReplacements),\n",
    "  (Howard)-[:DIRECTED]->(TheReplacements)\n",
    "CREATE (RescueDawn:Movie {title:'RescueDawn', released:2006, tagline:\"Based on the extraordinary true story of one man's fight for freedom\"})\n",
    "CREATE (ChristianB:Person {name:'Christian Bale', born:1974})\n",
    "CREATE (ZachG:Person {name:'Zach Grenier', born:1954})\n",
    "CREATE\n",
    "  (MarshallB)-[:ACTED_IN {roles:['Admiral']}]->(RescueDawn),\n",
    "  (ChristianB)-[:ACTED_IN {roles:['Dieter Dengler']}]->(RescueDawn),\n",
    "  (ZachG)-[:ACTED_IN {roles:['Squad Leader']}]->(RescueDawn),\n",
    "  (SteveZ)-[:ACTED_IN {roles:['Duane']}]->(RescueDawn),\n",
    "  (WernerH)-[:DIRECTED]->(RescueDawn)\n",
    "CREATE (TheBirdcage:Movie {title:'The Birdcage', released:1996, tagline:'Come as you are'})\n",
    "CREATE (MikeN:Person {name:'Mike Nichols', born:1931})\n",
    "CREATE\n",
    "  (Robin)-[:ACTED_IN {roles:['Armand Goldman']}]->(TheBirdcage),\n",
    "  (Nathan)-[:ACTED_IN {roles:['Albert Goldman']}]->(TheBirdcage),\n",
    "  (Gene)-[:ACTED_IN {roles:['Sen. Kevin Keeley']}]->(TheBirdcage),\n",
    "  (MikeN)-[:DIRECTED]->(TheBirdcage)\n",
    "CREATE (Unforgiven:Movie {title:'Unforgiven', released:1992, tagline:\"It's a hell of a thing, killing a man\"})\n",
    "CREATE (RichardH:Person {name:'Richard Harris', born:1930})\n",
    "CREATE (ClintE:Person {name:'Clint Eastwood', born:1930})\n",
    "CREATE\n",
    "  (RichardH)-[:ACTED_IN {roles:['English Bob']}]->(Unforgiven),\n",
    "  (ClintE)-[:ACTED_IN {roles:['Bill Munny']}]->(Unforgiven),\n",
    "  (Gene)-[:ACTED_IN {roles:['Little Bill Daggett']}]->(Unforgiven),\n",
    "  (ClintE)-[:DIRECTED]->(Unforgiven)\n",
    "CREATE (JohnnyMnemonic:Movie {title:'Johnny Mnemonic', released:1995, tagline:'The hottest data on earth. In the coolest head in town'})\n",
    "CREATE (Takeshi:Person {name:'Takeshi Kitano', born:1947})\n",
    "CREATE (Dina:Person {name:'Dina Meyer', born:1968})\n",
    "CREATE (IceT:Person {name:'Ice-T', born:1958})\n",
    "CREATE (RobertL:Person {name:'Robert Longo', born:1953})\n",
    "CREATE\n",
    "  (Keanu)-[:ACTED_IN {roles:['Johnny Mnemonic']}]->(JohnnyMnemonic),\n",
    "  (Takeshi)-[:ACTED_IN {roles:['Takahashi']}]->(JohnnyMnemonic),\n",
    "  (Dina)-[:ACTED_IN {roles:['Jane']}]->(JohnnyMnemonic),\n",
    "  (IceT)-[:ACTED_IN {roles:['J-Bone']}]->(JohnnyMnemonic),\n",
    "  (RobertL)-[:DIRECTED]->(JohnnyMnemonic)\n",
    "CREATE (CloudAtlas:Movie {title:'Cloud Atlas', released:2012, tagline:'Everything is connected'})\n",
    "CREATE (HalleB:Person {name:'Halle Berry', born:1966})\n",
    "CREATE (JimB:Person {name:'Jim Broadbent', born:1949})\n",
    "CREATE (TomT:Person {name:'Tom Tykwer', born:1965})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Zachry', 'Dr. Henry Goose', 'Isaac Sachs', 'Dermot Hoggins']}]->(CloudAtlas),\n",
    "  (Hugo)-[:ACTED_IN {roles:['Bill Smoke', 'Haskell Moore', 'Tadeusz Kesselring', 'Nurse Noakes', 'Boardman Mephi', 'Old Georgie']}]->(CloudAtlas),\n",
    "  (HalleB)-[:ACTED_IN {roles:['Luisa Rey', 'Jocasta Ayrs', 'Ovid', 'Meronym']}]->(CloudAtlas),\n",
    "  (JimB)-[:ACTED_IN {roles:['Vyvyan Ayrs', 'Captain Molyneux', 'Timothy Cavendish']}]->(CloudAtlas),\n",
    "  (TomT)-[:DIRECTED]->(CloudAtlas),\n",
    "  (AndyW)-[:DIRECTED]->(CloudAtlas),\n",
    "  (LanaW)-[:DIRECTED]->(CloudAtlas)\n",
    "CREATE (TheDaVinciCode:Movie {title:'The Da Vinci Code', released:2006, tagline:'Break The Codes'})\n",
    "CREATE (IanM:Person {name:'Ian McKellen', born:1939})\n",
    "CREATE (AudreyT:Person {name:'Audrey Tautou', born:1976})\n",
    "CREATE (PaulB:Person {name:'Paul Bettany', born:1971})\n",
    "CREATE (RonH:Person {name:'Ron Howard', born:1954})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Dr. Robert Langdon']}]->(TheDaVinciCode),\n",
    "  (IanM)-[:ACTED_IN {roles:['Sir Leight Teabing']}]->(TheDaVinciCode),\n",
    "  (AudreyT)-[:ACTED_IN {roles:['Sophie Neveu']}]->(TheDaVinciCode),\n",
    "  (PaulB)-[:ACTED_IN {roles:['Silas']}]->(TheDaVinciCode),\n",
    "  (RonH)-[:DIRECTED]->(TheDaVinciCode)\n",
    "CREATE (VforVendetta:Movie {title:'V for Vendetta', released:2006, tagline:'Freedom! Forever!'})\n",
    "CREATE (NatalieP:Person {name:'Natalie Portman', born:1981})\n",
    "CREATE (StephenR:Person {name:'Stephen Rea', born:1946})\n",
    "CREATE (JohnH:Person {name:'John Hurt', born:1940})\n",
    "CREATE (BenM:Person {name: 'Ben Miles', born:1967})\n",
    "CREATE\n",
    "  (Hugo)-[:ACTED_IN {roles:['V']}]->(VforVendetta),\n",
    "  (NatalieP)-[:ACTED_IN {roles:['Evey Hammond']}]->(VforVendetta),\n",
    "  (StephenR)-[:ACTED_IN {roles:['Eric Finch']}]->(VforVendetta),\n",
    "  (JohnH)-[:ACTED_IN {roles:['High Chancellor Adam Sutler']}]->(VforVendetta),\n",
    "  (BenM)-[:ACTED_IN {roles:['Dascomb']}]->(VforVendetta),\n",
    "  (JamesM)-[:DIRECTED]->(VforVendetta),\n",
    "  (AndyW)-[:PRODUCED]->(VforVendetta),\n",
    "  (LanaW)-[:PRODUCED]->(VforVendetta),\n",
    "  (JoelS)-[:PRODUCED]->(VforVendetta),\n",
    "  (AndyW)-[:WROTE]->(VforVendetta),\n",
    "  (LanaW)-[:WROTE]->(VforVendetta)\n",
    "CREATE (SpeedRacer:Movie {title:'Speed Racer', released:2008, tagline:'Speed has no limits'})\n",
    "CREATE (EmileH:Person {name:'Emile Hirsch', born:1985})\n",
    "CREATE (JohnG:Person {name:'John Goodman', born:1960})\n",
    "CREATE (SusanS:Person {name:'Susan Sarandon', born:1946})\n",
    "CREATE (MatthewF:Person {name:'Matthew Fox', born:1966})\n",
    "CREATE (ChristinaR:Person {name:'Christina Ricci', born:1980})\n",
    "CREATE (Rain:Person {name:'Rain', born:1982})\n",
    "CREATE\n",
    "  (EmileH)-[:ACTED_IN {roles:['Speed Racer']}]->(SpeedRacer),\n",
    "  (JohnG)-[:ACTED_IN {roles:['Pops']}]->(SpeedRacer),\n",
    "  (SusanS)-[:ACTED_IN {roles:['Mom']}]->(SpeedRacer),\n",
    "  (MatthewF)-[:ACTED_IN {roles:['Racer X']}]->(SpeedRacer),\n",
    "  (ChristinaR)-[:ACTED_IN {roles:['Trixie']}]->(SpeedRacer),\n",
    "  (Rain)-[:ACTED_IN {roles:['Taejo Togokahn']}]->(SpeedRacer),\n",
    "  (BenM)-[:ACTED_IN {roles:['Cass Jones']}]->(SpeedRacer),\n",
    "  (AndyW)-[:DIRECTED]->(SpeedRacer),\n",
    "  (LanaW)-[:DIRECTED]->(SpeedRacer),\n",
    "  (AndyW)-[:WROTE]->(SpeedRacer),\n",
    "  (LanaW)-[:WROTE]->(SpeedRacer),\n",
    "  (JoelS)-[:PRODUCED]->(SpeedRacer)\n",
    "CREATE (NinjaAssassin:Movie {title:'Ninja Assassin', released:2009, tagline:'Prepare to enter a secret world of assassins'})\n",
    "CREATE (NaomieH:Person {name:'Naomie Harris'})\n",
    "CREATE\n",
    "  (Rain)-[:ACTED_IN {roles:['Raizo']}]->(NinjaAssassin),\n",
    "  (NaomieH)-[:ACTED_IN {roles:['Mika Coretti']}]->(NinjaAssassin),\n",
    "  (RickY)-[:ACTED_IN {roles:['Takeshi']}]->(NinjaAssassin),\n",
    "  (BenM)-[:ACTED_IN {roles:['Ryan Maslow']}]->(NinjaAssassin),\n",
    "  (JamesM)-[:DIRECTED]->(NinjaAssassin),\n",
    "  (AndyW)-[:PRODUCED]->(NinjaAssassin),\n",
    "  (LanaW)-[:PRODUCED]->(NinjaAssassin),\n",
    "  (JoelS)-[:PRODUCED]->(NinjaAssassin)\n",
    "CREATE (TheGreenMile:Movie {title:'The Green Mile', released:1999, tagline:\"Walk a mile you'll never forget.\"})\n",
    "CREATE (MichaelD:Person {name:'Michael Clarke Duncan', born:1957})\n",
    "CREATE (DavidM:Person {name:'David Morse', born:1953})\n",
    "CREATE (SamR:Person {name:'Sam Rockwell', born:1968})\n",
    "CREATE (GaryS:Person {name:'Gary Sinise', born:1955})\n",
    "CREATE (PatriciaC:Person {name:'Patricia Clarkson', born:1959})\n",
    "CREATE (FrankD:Person {name:'Frank Darabont', born:1959})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Paul Edgecomb']}]->(TheGreenMile),\n",
    "  (MichaelD)-[:ACTED_IN {roles:['John Coffey']}]->(TheGreenMile),\n",
    "  (DavidM)-[:ACTED_IN {roles:['Brutus \"Brutal\" Howell']}]->(TheGreenMile),\n",
    "  (BonnieH)-[:ACTED_IN {roles:['Jan Edgecomb']}]->(TheGreenMile),\n",
    "  (JamesC)-[:ACTED_IN {roles:['Warden Hal Moores']}]->(TheGreenMile),\n",
    "  (SamR)-[:ACTED_IN {roles:['\"Wild Bill\" Wharton']}]->(TheGreenMile),\n",
    "  (GaryS)-[:ACTED_IN {roles:['Burt Hammersmith']}]->(TheGreenMile),\n",
    "  (PatriciaC)-[:ACTED_IN {roles:['Melinda Moores']}]->(TheGreenMile),\n",
    "  (FrankD)-[:DIRECTED]->(TheGreenMile)\n",
    "CREATE (FrostNixon:Movie {title:'Frost/Nixon', released:2008, tagline:'400 million people were waiting for the truth.'})\n",
    "CREATE (FrankL:Person {name:'Frank Langella', born:1938})\n",
    "CREATE (MichaelS:Person {name:'Michael Sheen', born:1969})\n",
    "CREATE (OliverP:Person {name:'Oliver Platt', born:1960})\n",
    "CREATE\n",
    "  (FrankL)-[:ACTED_IN {roles:['Richard Nixon']}]->(FrostNixon),\n",
    "  (MichaelS)-[:ACTED_IN {roles:['David Frost']}]->(FrostNixon),\n",
    "  (KevinB)-[:ACTED_IN {roles:['Jack Brennan']}]->(FrostNixon),\n",
    "  (OliverP)-[:ACTED_IN {roles:['Bob Zelnick']}]->(FrostNixon),\n",
    "  (SamR)-[:ACTED_IN {roles:['James Reston, Jr.']}]->(FrostNixon),\n",
    "  (RonH)-[:DIRECTED]->(FrostNixon)\n",
    "CREATE (Hoffa:Movie {title:'Hoffa', released:1992, tagline:\"He didn't want law. He wanted justice.\"})\n",
    "CREATE (DannyD:Person {name:'Danny DeVito', born:1944})\n",
    "CREATE (JohnR:Person {name:'John C. Reilly', born:1965})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Hoffa']}]->(Hoffa),\n",
    "  (DannyD)-[:ACTED_IN {roles:['Robert \"Bobby\" Ciaro']}]->(Hoffa),\n",
    "  (JTW)-[:ACTED_IN {roles:['Frank Fitzsimmons']}]->(Hoffa),\n",
    "  (JohnR)-[:ACTED_IN {roles:['Peter \"Pete\" Connelly']}]->(Hoffa),\n",
    "  (DannyD)-[:DIRECTED]->(Hoffa)\n",
    "CREATE (Apollo13:Movie {title:'Apollo 13', released:1995, tagline:'Houston, we have a problem.'})\n",
    "CREATE (EdH:Person {name:'Ed Harris', born:1950})\n",
    "CREATE (BillPax:Person {name:'Bill Paxton', born:1955})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Jim Lovell']}]->(Apollo13),\n",
    "  (KevinB)-[:ACTED_IN {roles:['Jack Swigert']}]->(Apollo13),\n",
    "  (EdH)-[:ACTED_IN {roles:['Gene Kranz']}]->(Apollo13),\n",
    "  (BillPax)-[:ACTED_IN {roles:['Fred Haise']}]->(Apollo13),\n",
    "  (GaryS)-[:ACTED_IN {roles:['Ken Mattingly']}]->(Apollo13),\n",
    "  (RonH)-[:DIRECTED]->(Apollo13)\n",
    "CREATE (Twister:Movie {title:'Twister', released:1996, tagline:\"Don't Breathe. Don't Look Back.\"})\n",
    "CREATE (PhilipH:Person {name:'Philip Seymour Hoffman', born:1967})\n",
    "CREATE (JanB:Person {name:'Jan de Bont', born:1943})\n",
    "CREATE\n",
    "  (BillPax)-[:ACTED_IN {roles:['Bill Harding']}]->(Twister),\n",
    "  (HelenH)-[:ACTED_IN {roles:['Dr. Jo Harding']}]->(Twister),\n",
    "  (ZachG)-[:ACTED_IN {roles:['Eddie']}]->(Twister),\n",
    "  (PhilipH)-[:ACTED_IN {roles:['Dustin \"Dusty\" Davis']}]->(Twister),\n",
    "  (JanB)-[:DIRECTED]->(Twister)\n",
    "CREATE (CastAway:Movie {title:'Cast Away', released:2000, tagline:'At the edge of the world, his journey begins.'})\n",
    "CREATE (RobertZ:Person {name:'Robert Zemeckis', born:1951})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Chuck Noland']}]->(CastAway),\n",
    "  (HelenH)-[:ACTED_IN {roles:['Kelly Frears']}]->(CastAway),\n",
    "  (RobertZ)-[:DIRECTED]->(CastAway)\n",
    "CREATE (OneFlewOvertheCuckoosNest:Movie {title:\"One Flew Over the Cuckoo's Nest\", released:1975, tagline:\"If he's crazy, what does that make you?\"})\n",
    "CREATE (MilosF:Person {name:'Milos Forman', born:1932})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Randle McMurphy']}]->(OneFlewOvertheCuckoosNest),\n",
    "  (DannyD)-[:ACTED_IN {roles:['Martini']}]->(OneFlewOvertheCuckoosNest),\n",
    "  (MilosF)-[:DIRECTED]->(OneFlewOvertheCuckoosNest)\n",
    "CREATE (SomethingsGottaGive:Movie {title:\"Something's Gotta Give\", released:2003})\n",
    "CREATE (DianeK:Person {name:'Diane Keaton', born:1946})\n",
    "CREATE (NancyM:Person {name:'Nancy Meyers', born:1949})\n",
    "CREATE\n",
    "  (JackN)-[:ACTED_IN {roles:['Harry Sanborn']}]->(SomethingsGottaGive),\n",
    "  (DianeK)-[:ACTED_IN {roles:['Erica Barry']}]->(SomethingsGottaGive),\n",
    "  (Keanu)-[:ACTED_IN {roles:['Julian Mercer']}]->(SomethingsGottaGive),\n",
    "  (NancyM)-[:DIRECTED]->(SomethingsGottaGive),\n",
    "  (NancyM)-[:PRODUCED]->(SomethingsGottaGive),\n",
    "  (NancyM)-[:WROTE]->(SomethingsGottaGive)\n",
    "CREATE (BicentennialMan:Movie {title:'Bicentennial Man', released:1999, tagline:\"One robot's 200 year journey to become an ordinary man.\"})\n",
    "CREATE (ChrisC:Person {name:'Chris Columbus', born:1958})\n",
    "CREATE\n",
    "  (Robin)-[:ACTED_IN {roles:['Andrew Marin']}]->(BicentennialMan),\n",
    "  (OliverP)-[:ACTED_IN {roles:['Rupert Burns']}]->(BicentennialMan),\n",
    "  (ChrisC)-[:DIRECTED]->(BicentennialMan)\n",
    "CREATE (CharlieWilsonsWar:Movie {title:\"Charlie Wilson's War\", released:2007, tagline:\"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\"})\n",
    "CREATE (JuliaR:Person {name:'Julia Roberts', born:1967})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Rep. Charlie Wilson']}]->(CharlieWilsonsWar),\n",
    "  (JuliaR)-[:ACTED_IN {roles:['Joanne Herring']}]->(CharlieWilsonsWar),\n",
    "  (PhilipH)-[:ACTED_IN {roles:['Gust Avrakotos']}]->(CharlieWilsonsWar),\n",
    "  (MikeN)-[:DIRECTED]->(CharlieWilsonsWar)\n",
    "CREATE (ThePolarExpress:Movie {title:'The Polar Express', released:2004, tagline:'This Holiday Season… Believe'})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Hero Boy', 'Father', 'Conductor', 'Hobo', 'Scrooge', 'Santa Claus']}]->(ThePolarExpress),\n",
    "  (RobertZ)-[:DIRECTED]->(ThePolarExpress)\n",
    "CREATE (ALeagueofTheirOwn:Movie {title:'A League of Their Own', released:1992, tagline:'Once in a lifetime you get a chance to do something different.'})\n",
    "CREATE (Madonna:Person {name:'Madonna', born:1954})\n",
    "CREATE (GeenaD:Person {name:'Geena Davis', born:1956})\n",
    "CREATE (LoriP:Person {name:'Lori Petty', born:1963})\n",
    "CREATE (PennyM:Person {name:'Penny Marshall', born:1943})\n",
    "CREATE\n",
    "  (TomH)-[:ACTED_IN {roles:['Jimmy Dugan']}]->(ALeagueofTheirOwn),\n",
    "  (GeenaD)-[:ACTED_IN {roles:['Dottie Hinson']}]->(ALeagueofTheirOwn),\n",
    "  (LoriP)-[:ACTED_IN {roles:['Kit Keller']}]->(ALeagueofTheirOwn),\n",
    "  (RosieO)-[:ACTED_IN {roles:['Doris Murphy']}]->(ALeagueofTheirOwn),\n",
    "  (Madonna)-[:ACTED_IN {roles:['\"All the Way\" Mae Mordabito']}]->(ALeagueofTheirOwn),\n",
    "  (BillPax)-[:ACTED_IN {roles:['Bob Hinson']}]->(ALeagueofTheirOwn),\n",
    "  (PennyM)-[:DIRECTED]->(ALeagueofTheirOwn)\n",
    "CREATE (PaulBlythe:Person {name:'Paul Blythe'})\n",
    "CREATE (AngelaScope:Person {name:'Angela Scope'})\n",
    "CREATE (JessicaThompson:Person {name:'Jessica Thompson'})\n",
    "CREATE (JamesThompson:Person {name:'James Thompson'})\n",
    "CREATE\n",
    "  (JamesThompson)-[:FOLLOWS]->(JessicaThompson),\n",
    "  (AngelaScope)-[:FOLLOWS]->(JessicaThompson),\n",
    "  (PaulBlythe)-[:FOLLOWS]->(AngelaScope)\n",
    "CREATE\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'An amazing journey', rating:95}]->(CloudAtlas),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'Silly, but fun', rating:65}]->(TheReplacements),\n",
    "  (JamesThompson)-[:REVIEWED {summary:'The coolest football movie ever', rating:100}]->(TheReplacements),\n",
    "  (AngelaScope)-[:REVIEWED {summary:'Pretty funny at times', rating:62}]->(TheReplacements),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'Dark, but compelling', rating:85}]->(Unforgiven),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:\"Slapstick redeemed only by the Robin Williams and Gene Hackman's stellar performances\", rating:45}]->(TheBirdcage),\n",
    "  (JessicaThompson)-[:REVIEWED {summary:'A solid romp', rating:68}]->(TheDaVinciCode),\n",
    "  (JamesThompson)-[:REVIEWED {summary:'Fun, but a little far fetched', rating:65}]->(TheDaVinciCode)\n",
    "// Parasite movie and cast\n",
    "CREATE (Parasite:Movie {title:'Parasite', released:2019, tagline:'Act like you own the place'})\n",
    "CREATE (KangHoSong:Person {name:'Kang-ho Song'})\n",
    "CREATE (SunKyunLee:Person {name:'Sun-kyun Lee'})\n",
    "CREATE (YeoJeongJo:Person {name:'Yeo-jeong Jo'})\n",
    "CREATE (WooSikChoi:Person {name:'Woo-sik Choi'})\n",
    "CREATE (SoDamPark:Person  {name:'So-dam Park'})\n",
    "CREATE\n",
    "  (KangHoSong)-[:ACTED_IN {roles:['Ki Taek']}]->(Parasite),\n",
    "  (SunKyunLee)-[:ACTED_IN {roles:['Dong Ik']}]->(Parasite),\n",
    "  (YeoJeongJo)-[:ACTED_IN {roles:['Yeon Kyo']}]->(Parasite),\n",
    "  (WooSikChoi)-[:ACTED_IN {roles:['Ki Woo']}]->(Parasite),\n",
    "  (SoDamPark)-[:ACTED_IN {roles:['Ki Jung']}]->(Parasite)\n",
    "// Joker movie and cast\n",
    "CREATE (Joker:Movie {title:'Joker', released:2019, tagline:'Put on a happy face'})\n",
    "CREATE (JoaquinPhoenix:Person {name:'Joaquin Phoenix'})\n",
    "CREATE (RobertDeNiro:Person {name:'Robert De Niro'})\n",
    "CREATE (ZazieBeetz:Person {name:'Zazie Beetz'})\n",
    "CREATE\n",
    "  (JoaquinPhoenix)-[:ACTED_IN {roles:['Arthur Fleck']}]->(Joker),\n",
    "  (RobertDeNiro)-[:ACTED_IN {roles:['Murray Franklin']}]->(Joker),\n",
    "  (ZazieBeetz)-[:ACTED_IN {roles:['Sophie Dumond']}]->(Joker)\n",
    ";\"\"\"\n",
    "\n",
    "session.run(q1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Searching for the all basic nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record A=<Node id=0 labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>>\n",
      "<Record A=<Node id=1 labels=frozenset({'Person'}) properties={'born': 1964, 'name': 'Keanu Reeves'}>>\n",
      "<Record A=<Node id=2 labels=frozenset({'Person'}) properties={'born': 1967, 'name': 'Carrie-Anne Moss'}>>\n",
      "<Record A=<Node id=3 labels=frozenset({'Person'}) properties={'born': 1961, 'name': 'Laurence Fishburne'}>>\n",
      "<Record A=<Node id=4 labels=frozenset({'Person'}) properties={'born': 1960, 'name': 'Hugo Weaving'}>>\n"
     ]
    }
   ],
   "source": [
    "q1 = 'MATCH (A) RETURN (A) LIMIT 5'\n",
    "nodes = session.run(q1)\n",
    "\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Visualizing the Movie Data Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4jupyter"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = 'bolt://localhost:7687'\n",
    "moviesdb = GraphDatabase.driver(uri=uri, auth=('neo4j', '123'))\n",
    "\n",
    "session = moviesdb.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"ca3fe1d4-7d20-43c1-8b4a-7d56d4ba927f\" style=\"height: 400px;\"></div>\n",
       "\n",
       "<script type=\"text/javascript\">\n",
       "\n",
       "    var nodes = [{\"id\": 96, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1931, name='Mike Nichols')\"}, {\"id\": 157, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2007, tagline=\\\"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\\\", title=\\\"Charlie Wilson's War\\\")\"}, {\"id\": 95, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1996, tagline='Come as you are', title='The Birdcage')\"}, {\"id\": 111, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1976, name='Audrey Tautou')\"}, {\"id\": 109, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2006, tagline='Break The Codes', title='The Da Vinci Code')\"}, {\"id\": 89, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1930, name='Gene Hackman')\"}, {\"id\": 97, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1992, tagline=\\\"It's a hell of a thing, killing a man\\\", title='Unforgiven')\"}, {\"id\": 87, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2000, tagline='Pain heals, Chicks dig scars... Glory lasts forever', title='The Replacements')\"}, {\"id\": 93, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1974, name='Christian Bale')\"}, {\"id\": 92, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2006, tagline=\\\"Based on the extraordinary true story of one man's fight for freedom\\\", title='RescueDawn')\"}, {\"id\": 23, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1957, name='Kevin Pollak')\"}, {\"id\": 15, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1992, tagline=\\\"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\\\", title='A Few Good Men')\"}, {\"id\": 64, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1971, name='Rick Yune')\"}, {\"id\": 126, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2009, tagline='Prepare to enter a secret world of assassins', title='Ninja Assassin')\"}, {\"id\": 62, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1999, tagline='First loves last. Forever.', title='Snow Falling on Cedars')\"}, {\"id\": 120, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1985, name='Emile Hirsch')\"}, {\"id\": 119, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2008, tagline='Speed has no limits', title='Speed Racer')\"}, {\"id\": 28, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1961, name='Aaron Sorkin')\"}, {\"id\": 101, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1947, name='Takeshi Kitano')\"}, {\"id\": 100, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1995, tagline='The hottest data on earth. In the coolest head in town', title='Johnny Mnemonic')\"}, {\"id\": 146, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1967, name='Philip Seymour Hoffman')\"}, {\"id\": 145, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1996, tagline=\\\"Don't Breathe. Don't Look Back.\\\", title='Twister')\"}, {\"id\": 142, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1995, tagline='Houston, we have a problem.', title='Apollo 13')\"}, {\"id\": 90, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1968, name='Orlando Jones')\"}, {\"id\": 165, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', name='Paul Blythe')\"}, {\"id\": 166, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', name='Angela Scope')\"}, {\"id\": 79, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1950, name='John Patrick Stanley')\"}, {\"id\": 78, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1990, tagline='A story of love, lava and burning desire.', title='Joe Versus the Volcano')\"}, {\"id\": 159, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2004, tagline='This Holiday Season\\u2026 Believe', title='The Polar Express')\"}, {\"id\": 168, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', name='James Thompson')\"}, {\"id\": 167, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', name='Jessica Thompson')\"}, {\"id\": 34, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1961, name='Meg Ryan')\"}, {\"id\": 73, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1993, tagline='What if someone you never met, someone you never saw, someone you never knew was the only someone for you?', title='Sleepless in Seattle')\"}, {\"id\": 67, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1998, tagline='At odds in life... in love on-line.', title=\\\"You've Got Mail\\\")\"}, {\"id\": 29, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1986, tagline='I feel the need, the need for speed.', title='Top Gun')\"}, {\"id\": 81, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1998, tagline='At odds in life... in love on-line.', title='When Harry Met Sally')\"}, {\"id\": 152, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2003, title=\\\"Something's Gotta Give\\\")\"}, {\"id\": 117, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1940, name='John Hurt')\"}, {\"id\": 114, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2006, tagline='Freedom! Forever!', title='V for Vendetta')\"}, {\"id\": 22, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1968, name='Cuba Gooding Jr.')\"}, {\"id\": 56, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1998, tagline='After life there is more. The end is just the beginning.', title='What Dreams May Come')\"}, {\"id\": 37, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2000, tagline='The rest of his life begins now.', title='Jerry Maguire')\"}, {\"id\": 52, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1997, tagline='A comedy from the heart that goes for the throat.', title='As Good as It Gets')\"}, {\"id\": 59, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1942, name='Werner Herzog')\"}, {\"id\": 136, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1938, name='Frank Langella')\"}, {\"id\": 135, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2008, tagline='400 million people were waiting for the truth.', title='Frost/Nixon')\"}, {\"id\": 155, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1999, tagline=\\\"One robot's 200 year journey to become an ordinary man.\\\", title='Bicentennial Man')\"}, {\"id\": 75, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1953, name='Bill Pullman')\"}, {\"id\": 106, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1966, name='Halle Berry')\"}, {\"id\": 105, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2012, tagline='Everything is connected', title='Cloud Atlas')\"}, {\"id\": 131, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1968, name='Sam Rockwell')\"}, {\"id\": 128, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1999, tagline=\\\"Walk a mile you'll never forget.\\\", title='The Green Mile')\"}, {\"id\": 108, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1965, name='Tom Tykwer')\"}, {\"id\": 140, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1944, name='Danny DeVito')\"}, {\"id\": 139, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1992, tagline=\\\"He didn't want law. He wanted justice.\\\", title='Hoffa')\"}, {\"id\": 150, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1975, tagline=\\\"If he's crazy, what does that make you?\\\", title=\\\"One Flew Over the Cuckoo's Nest\\\")\"}, {\"id\": 103, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1958, name='Ice-T')\"}, {\"id\": 38, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1969, name='Renee Zellweger')\"}, {\"id\": 137, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1969, name='Michael Sheen')\"}, {\"id\": 130, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1953, name='David Morse')\"}, {\"id\": 102, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1968, name='Dina Meyer')\"}, {\"id\": 57, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1960, name='Annabella Sciorra')\"}, {\"id\": 132, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1955, name='Gary Sinise')\"}, {\"id\": 138, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1960, name='Oliver Platt')\"}, {\"id\": 99, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1930, name='Clint Eastwood')\"}, {\"id\": 148, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2000, tagline='At the edge of the world, his journey begins.', title='Cast Away')\"}, {\"id\": 134, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1959, name='Frank Darabont')\"}, {\"id\": 116, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1946, name='Stephen Rea')\"}, {\"id\": 80, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1956, name='Nathan Lane')\"}, {\"id\": 133, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1959, name='Patricia Clarkson')\"}, {\"id\": 121, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1960, name='John Goodman')\"}, {\"id\": 77, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1962, name=\\\"Rosie O'Donnell\\\")\"}, {\"id\": 160, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1992, tagline='Once in a lifetime you get a chance to do something different.', title='A League of Their Own')\"}, {\"id\": 19, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1958, name='Kevin Bacon')\"}, {\"id\": 11, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1997, tagline='Evil has its winning ways', title=\\\"The Devil's Advocate\\\")\"}, {\"id\": 4, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1960, name='Hugo Weaving')\"}, {\"id\": 10, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2003, tagline='Everything that has a beginning has an end', title='The Matrix Revolutions')\"}, {\"id\": 9, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=2003, tagline='Free your mind', title='The Matrix Reloaded')\"}, {\"id\": 0, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1999, tagline='Welcome to the Real World', title='The Matrix')\"}, {\"id\": 7, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1952, name='Joel Silver')\"}, {\"id\": 82, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1948, name='Billy Crystal')\"}, {\"id\": 70, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1967, name='Steve Zahn')\"}, {\"id\": 98, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1930, name='Richard Harris')\"}, {\"id\": 94, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1954, name='Zach Grenier')\"}, {\"id\": 68, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1968, name='Parker Posey')\"}, {\"id\": 72, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1941, name='Nora Ephron')\"}, {\"id\": 44, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1996, name='Jonathan Lipnicki')\"}, {\"id\": 49, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1972, name='Wil Wheaton')\"}, {\"id\": 46, \"label\": \"\", \"group\": \"Movie\", \"title\": \"Node('Movie', released=1986, tagline=\\\"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\\\", title='Stand By Me')\"}, {\"id\": 74, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1956, name='Rita Wilson')\"}, {\"id\": 39, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1962, name='Kelly Preston')\"}, {\"id\": 35, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1944, name='Tony Scott')\"}, {\"id\": 20, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1966, name='Kiefer Sutherland')\"}, {\"id\": 42, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1961, name='Bonnie Hunt')\"}, {\"id\": 32, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1962, name='Anthony Edwards')\"}, {\"id\": 144, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1955, name='Bill Paxton')\"}, {\"id\": 158, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1967, name='Julia Roberts')\"}, {\"id\": 58, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1929, name='Max von Sydow')\"}, {\"id\": 33, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1933, name='Tom Skerritt')\"}, {\"id\": 115, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1981, name='Natalie Portman')\"}, {\"id\": 55, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1940, name='James L. Brooks')\"}, {\"id\": 147, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1943, name='Jan de Bont')\"}, {\"id\": 122, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1946, name='Susan Sarandon')\"}, {\"id\": 76, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1949, name='Victor Garber')\"}, {\"id\": 153, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1946, name='Diane Keaton')\"}, {\"id\": 162, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1956, name='Geena Davis')\"}, {\"id\": 13, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1940, name='Al Pacino')\"}, {\"id\": 50, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1966, name='John Cusack')\"}, {\"id\": 149, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1951, name='Robert Zemeckis')\"}, {\"id\": 45, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1957, name='Cameron Crowe')\"}, {\"id\": 18, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1962, name='Demi Moore')\"}, {\"id\": 47, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1970, name='River Phoenix')\"}, {\"id\": 83, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1956, name='Carrie Fisher')\"}, {\"id\": 26, \"label\": \"\", \"group\": \"Person\", \"title\": \"Node('Person', born=1948, name='Christopher Guest')\"}];\n",
       "    var edges = [{\"from\": 96, \"to\": 157, \"label\": \"DIRECTED\"}, {\"from\": 96, \"to\": 95, \"label\": \"DIRECTED\"}, {\"from\": 111, \"to\": 109, \"label\": \"ACTED_IN\"}, {\"from\": 89, \"to\": 97, \"label\": \"ACTED_IN\"}, {\"from\": 89, \"to\": 95, \"label\": \"ACTED_IN\"}, {\"from\": 89, \"to\": 87, \"label\": \"ACTED_IN\"}, {\"from\": 93, \"to\": 92, \"label\": \"ACTED_IN\"}, {\"from\": 23, \"to\": 15, \"label\": \"ACTED_IN\"}, {\"from\": 64, \"to\": 126, \"label\": \"ACTED_IN\"}, {\"from\": 64, \"to\": 62, \"label\": \"ACTED_IN\"}, {\"from\": 120, \"to\": 119, \"label\": \"ACTED_IN\"}, {\"from\": 28, \"to\": 15, \"label\": \"ACTED_IN\"}, {\"from\": 28, \"to\": 15, \"label\": \"WROTE\"}, {\"from\": 101, \"to\": 100, \"label\": \"ACTED_IN\"}, {\"from\": 146, \"to\": 145, \"label\": \"ACTED_IN\"}, {\"from\": 146, \"to\": 157, \"label\": \"ACTED_IN\"}, {\"from\": 90, \"to\": 87, \"label\": \"ACTED_IN\"}, {\"from\": 165, \"to\": 166, \"label\": \"FOLLOWS\"}, {\"from\": 79, \"to\": 78, \"label\": \"DIRECTED\"}, {\"from\": 168, \"to\": 87, \"label\": \"REVIEWED\"}, {\"from\": 168, \"to\": 167, \"label\": \"FOLLOWS\"}, {\"from\": 168, \"to\": 109, \"label\": \"REVIEWED\"}, {\"from\": 34, \"to\": 73, \"label\": \"ACTED_IN\"}, {\"from\": 34, \"to\": 67, \"label\": \"ACTED_IN\"}, {\"from\": 34, \"to\": 29, \"label\": \"ACTED_IN\"}, {\"from\": 34, \"to\": 81, \"label\": \"ACTED_IN\"}, {\"from\": 34, \"to\": 78, \"label\": \"ACTED_IN\"}, {\"from\": 117, \"to\": 114, \"label\": \"ACTED_IN\"}, {\"from\": 22, \"to\": 56, \"label\": \"ACTED_IN\"}, {\"from\": 22, \"to\": 37, \"label\": \"ACTED_IN\"}, {\"from\": 22, \"to\": 52, \"label\": \"ACTED_IN\"}, {\"from\": 22, \"to\": 15, \"label\": \"ACTED_IN\"}, {\"from\": 59, \"to\": 92, \"label\": \"DIRECTED\"}, {\"from\": 59, \"to\": 56, \"label\": \"ACTED_IN\"}, {\"from\": 136, \"to\": 135, \"label\": \"ACTED_IN\"}, {\"from\": 75, \"to\": 73, \"label\": \"ACTED_IN\"}, {\"from\": 106, \"to\": 105, \"label\": \"ACTED_IN\"}, {\"from\": 131, \"to\": 128, \"label\": \"ACTED_IN\"}, {\"from\": 131, \"to\": 135, \"label\": \"ACTED_IN\"}, {\"from\": 108, \"to\": 105, \"label\": \"DIRECTED\"}, {\"from\": 140, \"to\": 139, \"label\": \"ACTED_IN\"}, {\"from\": 140, \"to\": 150, \"label\": \"ACTED_IN\"}, {\"from\": 140, \"to\": 139, \"label\": \"DIRECTED\"}, {\"from\": 103, \"to\": 100, \"label\": \"ACTED_IN\"}, {\"from\": 38, \"to\": 37, \"label\": \"ACTED_IN\"}, {\"from\": 137, \"to\": 135, \"label\": \"ACTED_IN\"}, {\"from\": 130, \"to\": 128, \"label\": \"ACTED_IN\"}, {\"from\": 102, \"to\": 100, \"label\": \"ACTED_IN\"}, {\"from\": 57, \"to\": 56, \"label\": \"ACTED_IN\"}, {\"from\": 132, \"to\": 128, \"label\": \"ACTED_IN\"}, {\"from\": 132, \"to\": 142, \"label\": \"ACTED_IN\"}, {\"from\": 138, \"to\": 135, \"label\": \"ACTED_IN\"}, {\"from\": 138, \"to\": 155, \"label\": \"ACTED_IN\"}, {\"from\": 99, \"to\": 97, \"label\": \"ACTED_IN\"}, {\"from\": 99, \"to\": 97, \"label\": \"DIRECTED\"}, {\"from\": 134, \"to\": 128, \"label\": \"DIRECTED\"}, {\"from\": 116, \"to\": 114, \"label\": \"ACTED_IN\"}, {\"from\": 80, \"to\": 78, \"label\": \"ACTED_IN\"}, {\"from\": 80, \"to\": 95, \"label\": \"ACTED_IN\"}, {\"from\": 133, \"to\": 128, \"label\": \"ACTED_IN\"}, {\"from\": 121, \"to\": 119, \"label\": \"ACTED_IN\"}, {\"from\": 77, \"to\": 160, \"label\": \"ACTED_IN\"}, {\"from\": 77, \"to\": 73, \"label\": \"ACTED_IN\"}, {\"from\": 19, \"to\": 142, \"label\": \"ACTED_IN\"}, {\"from\": 19, \"to\": 135, \"label\": \"ACTED_IN\"}, {\"from\": 19, \"to\": 15, \"label\": \"ACTED_IN\"}, {\"from\": 4, \"to\": 105, \"label\": \"ACTED_IN\"}, {\"from\": 4, \"to\": 114, \"label\": \"ACTED_IN\"}, {\"from\": 4, \"to\": 10, \"label\": \"ACTED_IN\"}, {\"from\": 4, \"to\": 9, \"label\": \"ACTED_IN\"}, {\"from\": 4, \"to\": 0, \"label\": \"ACTED_IN\"}, {\"from\": 166, \"to\": 167, \"label\": \"FOLLOWS\"}, {\"from\": 166, \"to\": 87, \"label\": \"REVIEWED\"}, {\"from\": 7, \"to\": 114, \"label\": \"PRODUCED\"}, {\"from\": 7, \"to\": 119, \"label\": \"PRODUCED\"}, {\"from\": 7, \"to\": 126, \"label\": \"PRODUCED\"}, {\"from\": 7, \"to\": 10, \"label\": \"PRODUCED\"}, {\"from\": 7, \"to\": 9, \"label\": \"PRODUCED\"}, {\"from\": 7, \"to\": 0, \"label\": \"PRODUCED\"}, {\"from\": 82, \"to\": 81, \"label\": \"ACTED_IN\"}, {\"from\": 70, \"to\": 92, \"label\": \"ACTED_IN\"}, {\"from\": 70, \"to\": 67, \"label\": \"ACTED_IN\"}, {\"from\": 98, \"to\": 97, \"label\": \"ACTED_IN\"}, {\"from\": 94, \"to\": 92, \"label\": \"ACTED_IN\"}, {\"from\": 94, \"to\": 145, \"label\": \"ACTED_IN\"}, {\"from\": 68, \"to\": 67, \"label\": \"ACTED_IN\"}, {\"from\": 72, \"to\": 67, \"label\": \"DIRECTED\"}, {\"from\": 72, \"to\": 81, \"label\": \"PRODUCED\"}, {\"from\": 72, \"to\": 73, \"label\": \"DIRECTED\"}, {\"from\": 72, \"to\": 81, \"label\": \"WROTE\"}, {\"from\": 44, \"to\": 37, \"label\": \"ACTED_IN\"}, {\"from\": 49, \"to\": 46, \"label\": \"ACTED_IN\"}, {\"from\": 74, \"to\": 73, \"label\": \"ACTED_IN\"}, {\"from\": 39, \"to\": 37, \"label\": \"ACTED_IN\"}, {\"from\": 35, \"to\": 29, \"label\": \"DIRECTED\"}, {\"from\": 20, \"to\": 46, \"label\": \"ACTED_IN\"}, {\"from\": 20, \"to\": 15, \"label\": \"ACTED_IN\"}, {\"from\": 42, \"to\": 37, \"label\": \"ACTED_IN\"}, {\"from\": 42, \"to\": 128, \"label\": \"ACTED_IN\"}, {\"from\": 32, \"to\": 29, \"label\": \"ACTED_IN\"}, {\"from\": 144, \"to\": 160, \"label\": \"ACTED_IN\"}, {\"from\": 144, \"to\": 145, \"label\": \"ACTED_IN\"}, {\"from\": 144, \"to\": 142, \"label\": \"ACTED_IN\"}, {\"from\": 158, \"to\": 157, \"label\": \"ACTED_IN\"}, {\"from\": 58, \"to\": 56, \"label\": \"ACTED_IN\"}, {\"from\": 58, \"to\": 62, \"label\": \"ACTED_IN\"}, {\"from\": 33, \"to\": 29, \"label\": \"ACTED_IN\"}, {\"from\": 115, \"to\": 114, \"label\": \"ACTED_IN\"}, {\"from\": 55, \"to\": 52, \"label\": \"DIRECTED\"}, {\"from\": 147, \"to\": 145, \"label\": \"DIRECTED\"}, {\"from\": 122, \"to\": 119, \"label\": \"ACTED_IN\"}, {\"from\": 167, \"to\": 97, \"label\": \"REVIEWED\"}, {\"from\": 167, \"to\": 95, \"label\": \"REVIEWED\"}, {\"from\": 167, \"to\": 105, \"label\": \"REVIEWED\"}, {\"from\": 167, \"to\": 87, \"label\": \"REVIEWED\"}, {\"from\": 167, \"to\": 109, \"label\": \"REVIEWED\"}, {\"from\": 76, \"to\": 73, \"label\": \"ACTED_IN\"}, {\"from\": 153, \"to\": 152, \"label\": \"ACTED_IN\"}, {\"from\": 162, \"to\": 160, \"label\": \"ACTED_IN\"}, {\"from\": 13, \"to\": 11, \"label\": \"ACTED_IN\"}, {\"from\": 50, \"to\": 46, \"label\": \"ACTED_IN\"}, {\"from\": 149, \"to\": 148, \"label\": \"DIRECTED\"}, {\"from\": 149, \"to\": 159, \"label\": \"DIRECTED\"}, {\"from\": 45, \"to\": 37, \"label\": \"PRODUCED\"}, {\"from\": 45, \"to\": 37, \"label\": \"DIRECTED\"}, {\"from\": 45, \"to\": 37, \"label\": \"WROTE\"}, {\"from\": 18, \"to\": 15, \"label\": \"ACTED_IN\"}, {\"from\": 47, \"to\": 46, \"label\": \"ACTED_IN\"}, {\"from\": 83, \"to\": 81, \"label\": \"ACTED_IN\"}, {\"from\": 26, \"to\": 15, \"label\": \"ACTED_IN\"}];\n",
       "\n",
       "    var container = document.getElementById(\"ca3fe1d4-7d20-43c1-8b4a-7d56d4ba927f\");\n",
       "\n",
       "    var data = {\n",
       "        nodes: nodes,\n",
       "        edges: edges\n",
       "    };\n",
       "\n",
       "    var options = {\n",
       "    nodes: {\n",
       "        shape: 'dot',\n",
       "        size: 25,\n",
       "        font: {\n",
       "            size: 14\n",
       "        }\n",
       "    },\n",
       "    edges: {\n",
       "        font: {\n",
       "            size: 14,\n",
       "            align: 'middle'\n",
       "        },\n",
       "        color: 'gray',\n",
       "        arrows: {\n",
       "            to: {\n",
       "                enabled: true,\n",
       "                scaleFactor: 0.5\n",
       "            }\n",
       "        },\n",
       "        smooth: {\n",
       "            enabled: false\n",
       "        }\n",
       "    },\n",
       "    physics: {\n",
       "        enabled: true\n",
       "        }\n",
       "    };\n",
       "\n",
       "    var network = new vis.Network(container, data, options);\n",
       "\n",
       "</script>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create a py2neo graph object\n",
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph(uri, auth=('neo4j', '123'))\n",
    "\n",
    "# Calling  the instance to create the graph \n",
    "neo4jupyter.draw(graph,{'frozenset':'Movie'}, physics=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record people.name='Keanu Reeves'>\n",
      "<Record people.name='Carrie-Anne Moss'>\n",
      "<Record people.name='Laurence Fishburne'>\n",
      "<Record people.name='Hugo Weaving'>\n",
      "<Record people.name='Andy Wachowski'>\n"
     ]
    }
   ],
   "source": [
    "# Query to find the actor names\n",
    "q= 'MATCH (people:Person)RETURN people.name LIMIT 5'\n",
    "\n",
    "nodes = session.run(q)\n",
    "\n",
    "for node in nodes :\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record keanu=<Node id=1 labels=frozenset({'Person'}) properties={'born': 1964, 'name': 'Keanu Reeves'}>>\n"
     ]
    }
   ],
   "source": [
    "# Query to find the actor name Keanu Reeves\n",
    "q = 'MATCH(keanu{name:\"Keanu Reeves\"}) RETURN keanu '\n",
    "\n",
    "nodes = session.run(q)\n",
    "\n",
    "for node in nodes :\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record films.title='The Matrix'>\n",
      "<Record films.title='The Matrix Reloaded'>\n",
      "<Record films.title='The Matrix Revolutions'>\n",
      "<Record films.title=\"The Devil's Advocate\">\n",
      "<Record films.title='A Few Good Men'>\n"
     ]
    }
   ],
   "source": [
    "# Query to find the title of the movies\n",
    "q = 'MATCH (films:Movie)RETURN films.title LIMIT 5'\n",
    "\n",
    "nodes = session.run(q)\n",
    "\n",
    "for node in nodes :\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record matrix=<Node id=0 labels=frozenset({'Movie'}) properties={'tagline': 'Welcome to the Real World', 'title': 'The Matrix', 'released': 1999}>>\n"
     ]
    }
   ],
   "source": [
    "# Query to find the movie with the title 'The Matrix'\n",
    "q = 'MATCH (matrix{title:\"The Matrix\"}) RETURN matrix'\n",
    "\n",
    "nodes = session.run(q)\n",
    "\n",
    "for node in nodes :\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record film.title='The Replacements'>\n",
      "<Record film.title='Johnny Mnemonic'>\n",
      "<Record film.title=\"Something's Gotta Give\">\n",
      "<Record film.title=\"The Devil's Advocate\">\n",
      "<Record film.title='The Matrix Revolutions'>\n"
     ]
    }
   ],
   "source": [
    "# Query to find the movieS in which Keanu Reeves has been acted '\n",
    "\n",
    "q = \"MATCH (actor:Person)-[:ACTED_IN]-(film:Movie) WHERE actor.name='Keanu Reeves'  RETURN film.title LIMIT 5\"\n",
    "\n",
    "nodes = session.run(q)\n",
    "\n",
    "for node in nodes :\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cloud Atlas\n",
      "V for Vendetta\n",
      "The Matrix Revolutions\n",
      "The Matrix Reloaded\n",
      "The Replacements\n",
      "Johnny Mnemonic\n",
      "Something's Gotta Give\n",
      "The Devil's Advocate\n"
     ]
    }
   ],
   "source": [
    "# Query to get the list of movies your favorite movies cast has been contributed \n",
    "\n",
    "cypher_query = '''\n",
    "MATCH (movie:Movie {title:$favorite})<-[:ACTED_IN]-(actor)-[:ACTED_IN]->(rec:Movie)\n",
    " RETURN distinct rec.title as title LIMIT 20\n",
    "'''\n",
    "favorite_movie = input('Enter Your favorite movie to get you favorite casts movies list')\n",
    "with moviesdb.session(database=\"neo4j\") as session:\n",
    "  results = session.read_transaction(\n",
    "    lambda tx: tx.run(cypher_query, favorite=favorite_movie).data())\n",
    "  for record in results:\n",
    "    print(record['title'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.0 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "49925a85a85dac8a2dca5afbebde9d93135fdd4b812dbf89ef8044a5eedbb9bf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
